#!/usr/bin/python
#-*- coding: utf-8 -*-

import time

import utils

# Defines the HSK grade character
# Basic:        803
# Elementary:   798
# Intermediate: 589
# Advanced:     670
hanziByGrades = [
    (u'HSK Basic', u'一七万三上下不且世业东丢两个中丰为主举久么义之乐九也习书买乱了事二云互五些交产亮亲人亿什今介从他代以们件任休会伟但位低住体何作你使例侯便信俩倍倒候借假做停健傅像儿元先克全八公六共关兴其典内再冒写农冬决况冷净准凉几出刀分切划刚初利别刮到刻前剩力办加务动助努劳包化北医十千午半单卖南占卡危厂历原去参又友双反发取变口句只叫可史右号吃各合同名后向吗吧听吹呀告呐员呢周和咖咱咳哈响哥哪哭唱商啊啡啤啦喂喊喜喝嗯嗽嘛嘴器四回因团园困围国图圆在地场坏坐块坚城基堂墙增声处备复夏外多夜够大天太夫头女奶她好如妈妹始姐姑姓娘子字学孩它安完定宜实客室宴家容宿寄富寒对导封将小少尤就尺局层屋展山岁工左差己已市布师希带帮常帽干平年幸广床应店府度座庭康建开弟张当录彩影往很得心必志忘忙快念忽态怎怕思急总息您情惯想愉意感愿慢懂成我或戴户房所手才打扬批找技把报抬抱抽拉拍拾拿持挂指挤挺换掉掌排接推提握搞搬摆播操擦支收改放政故教敢散数整文斤新方旁旅族日旧早时明易星春昨是晚晨晴暖更最月有朋服望朝期本术机杂李村束条来杯板极果查树校样根桌桔桥检棵椅楚楼概橘次欢歌正步死段母每比毛民气水永求汉江汤汽没河治法注泳洗活派流浅济海消深清渴游湖满漂演澡火灯点炼烦烧热然照熟爬爱父爸片牛物特猪玩现班球理瓶生用电男画界留疼病痛白百的目直相省看真眼着睛睡知短矮研破础确碗碰磁示礼社祖祝神票福离秋种科租究空穿突窗立站章笑笔第等答简算篇篮米精糖系紧累红级纪纸练组细织绍经结给继绩续绿羊翻老考者而联肉育胜能脏脚脱脸腿自舍舒舞般船色艺节花苦英苹茶草药菜蓝蕉虽蛋行街衣表袜被装西要见观视览觉角解言计认讨让记讲许论设访评识诉词译试话该语误说请读课谁调谅谈谊谢象负责贵赛赢走起足跑跟路跳践踢身躺车轻较辅辆输辛边过迎运近还这进远连迟退送适通遇遍道那邮部都酒酸里重钟钢钱铅银错锻长门问间闻阳阴附院除险难集雨雪零需青静非面鞋音页须顾顿预领题颜风飞食饭饱饺饿馆首香马驾验骑高鱼鸡麻黄齐'),
    (u'HSK Elementary', u'丈与专丝严临丽乎乏乒乓乘乡争于井亩享京仅仍仔付令仪仰价份仿企伍众优伙伞传伤伯估伸似余佛供依侵促俗保修俱倡值偏偷傍催傲傻允兄充光免兔党入兵具养册军冠冰冲冻减凡击列则创判制刷刺剧剪副割劝功励劲势勇勺匹区升卜卫印即却卷厅厉压厌厕厘厚厨县叉及叔受叠古另召台叶司吊吐吓否吨吩含启吵吸呆味呼命咐咬咽品哇哎哲哼善喷嗓嘿嚷固圈土圾址均坡垃型埋堆堵塑塔填境墨壁士壶央失夹夺奇奋奖套妇妙妻委姨姻婚嫂孔存季守宝宣害宽宾密察寸寻射尊尖尝尽尾居届属岛岸崇巧巨巩巴巾币帝席幅并庄庆序底庙延异弃弄式引弯弱弹强形彻征待律微德忆忍怒怜性怪恋恐恢恨恳悄悉悔悟悠悲惊惹愁愤慌慕慰懒戏战戚扁扇扎扑扔托扛扣执扩扫扭扮扰扶承抄抓投抖抗折抢护披担拆拐拒拔拖招拜拣拥拦择括拼按挑挖挡挥挨捆捉捕捞损捡捧据掀授掏探控措描插援搁搭摇摔摘撒撕撞攻效敌救敬敲斗料斜断施旗无既昏映显晒晓普景暂暑暗曾替朗木未朴朵杀杆材松构析林枪架某染柴柿标株格案桶梁梦梨梯械棉森植榜模欠欺款歇歉止此武歪殊毕毫毯汗池污沉沙油沿泛泥泪泼洋洒洞测浓浪浮涂涨液淡混添渐渠渡温港湿源滑滚滴漏漠激灭灰灵灾炮烂烈烟烤烫煤煮熊燃燥爷版牌牙牲牵牺犯状狗独狮狼猜猫献猴率玉王环玻珠璃瓜甜甩田由略疑疲瘦登皂皇皮盆益盐盒盖盗盘盼盾睁瞧矛石矿码砍硬碎碑磨禁秀私秒秘秩积称移程稍稳稻稼穷窄竞竟童端竹符筑策筷签管箭箱类粉粒粗粘粮糊糕糟素紫繁纠纤约纷纺线终绕绝统绢绪绳维综编缩缺罐网置美羡群羽翅耐耳聊职聪肃肚肝肠肤肥肩肯肺胃胆背胖胡胳胸脆脉脑脖脾腐腰膀膊臭至致舌航良艰苯范荣获菌萝营落著蔬薄藏虎虑虚虫蛇蜂蜜血补衫衬袋袖裙裤规触警订训议讯证诗诚详谓豆貌贡败货质购贯贴贸费贺资赔赞赶趁超越趟趣跃跌距跨跪踩蹲躲转轮软辉辟达迅迈违迫述迷迹追逃选透逐递途逗逛速造逢逼遭遵避邀邻郊郎配酱醉醋醒采释野量金针钓钻铁铃铜铺锅锐键镜闪闭闯闲闹阅阔队防阵阶阿际陆降限陪随隔雄雷雾露靠革顶项顺颗飘餐饼馒骂骄骗骨鬼鲜鸟鹅麦默鼓鼻龄龙'),
    (u'HSK Intermediate', u'丁丑丘丙丛丧串丸乖乙予亏亚亡亭仇仓仗伊伴伺佩佳侧侨侮俄俏俯倘倚倦债倾偶偿僚僵兑兰兼兽冤冶凑凝凭凳凶凿刊删削剖剥劣勃勉勤勾匀匆匙华协博卧卵卸厢叙叭叹吞吻吼呵咙咸哀哆哗哟哦哨唇唤售喇喉喘喽嗦嘱噢囱圣坑坝坟坦垂垄垫垮域培堤塌塞墓墟壤壮壳夸奈奔奠奥奴妥妨姥姿威娃娱娶婆婴婶媳嫁嫌嫩孙孤宁宅宇宏宗官宙审宪宫宵寂寓寞寡寿尔尘尚屁屈屿岗岩峡峰崖崭巷帐帘帜幕幢幻幼库废廊廓弓归彼径徒御循忠怀怖怨恰恶患悦悬惕惜惦惨惭愈愚愧慎慧憾截扒扯抑抛抵抹押拢拧拨拳拴挣挫振挽捏捷掠掩揉揪揭搂搅搓搜摄摊摧摩撑撤攀敏斥斯旋旦旬旱昆晃晕晰智暴曲末朽权枉枕枝枯柄柏柔柜柱柳核栽桃档桩梅梳棋棍棒棚椒楞横欣歼残殖殿毁毅毒氏氓氛氧汇沟沸沾泌泡波泽洁洪浆浇浑浴浸涉涌润淆淋淹渔渣溅溉溜溶滥滩漆漫潮灌灸灿炉炒炸烁烛焊焦焰煌煎熬燕爆爹牢牧犹狂狠狡狱猎猛猾猿珍琴瓣瓦瓷甘甚甭甲申畅畔番疆疗疯疾症痕癌皱盏监盛盟盯盲眉眠眯督瞎瞒瞪矩砖砸碍碱秧稀税稚稿窑窜窟窿竭笼筋筐筒籍粥粪粱索纯纱纲纵纹绑络缓缘缚缝缸罚罢罩罪署翁翘耀耍耕耗耽聚肌股肿胀胁胞胶腔腾膏膨舅舰舱艘艳芽苍苗若茅荐荒菠萄葡蒙蒸蓬蔑虾蚀蚊蚕蛙蜡蝇蝴蝶蠢衡衰衷袍袭袱裁裂裕裹譬讶讽诊诞询诬诵谋谜谣谦谨谷豪豫财贫贱赏赚赠赤趴踊踏蹄蹈蹬躁轨载辈辑辜辞辣辩辱返逝逮逻遗遥遮酬酷鉴钉钞钥钩铝铲铸锁锈锡锣镇镑闷阂阻陈陌陡陵陷隐障隶雇雕震霉霜顷顽颂额颤饥饮饰饲饶驮驴驶驻驼骆骚骤魂鲸鸣鸭鸽黎齿'),
    (u'HSK Advanced', u'丹乃乌乔乞乳亢亦仁仆仙伏伐伪伶佣侄侈侍侣侦俊俐俘俭储僻兆兜兢冈凄凌凤凯凰凸凹函刁刃刑刨券刹剂剃剑劈劫勒勘勿匠匪卑卓厦叁叛叨叮叼吁吉君吟呈呕呜呻咋咏咨哄哑唆唐唠唯唾啃啄啥啸喻嗅嘉嘲噪嚼囊坊坛坯垒垦埠堕堡堪塘壹夕奉奏奢奸妄妆妒妖姆姜娇媒嫉孕孝宰寇寨寺尸尼尿屉屎屏屑屠屡履屯岂岔岭峻崩嵌川州巡巫帅帆帖幽庞庸廉弊弥弦彰役徊徐徘徽忌忧怠怯恒恩恭恼悼惋惑惠惧惩惫惰慈慨慷憋戒抚抠抡拄拇拌拓拘拙拟拱拽挎挚挟挠挪捅捌捍捎捐捣捶捻掂掐掘掰掷掺揍揽搀搏携摸撇撵擅攒敞敷斑斧斩旨旷旺昂昌昧昼晋晌晤晶晾暄暮曰杏杜杠杨杰枚枣柒柠柬栋栏栗桂桅框桐桑桨梗梢梧棕棱棺椭榆榨榴榷槐槽樱橡檬欲歧歹殃殴毙氢氮汁汛汞汪汰汹沃沏沛沥沫沼泄泉泊泣泰泻津洲洽浊浩涕涛涝涤淀淇淘淫渗渺湾溃溪滋滔滞滤滨潜潦潭澄瀑灶炊炎炕炭烘烹熄熏熔爪爽犁犬狈狐狭狸猖玖玫玲珊珑琢瑚瑞瑰畏畜畴疏疙疤疫疮痒痪痰痴痹瘟瘤瘩瘫瘸皆盈眨眶睦睬睹瞥瞩瞻砂砌硅硫碌碟碧碳磋磕磷祥祸禽禾秃秆秉秤秽稠穆穗穴窃窝竖竿笆笋笛笨筛筝筹箩篱簸籽粹糠絮纳绅绒绘绞绣绵绷绸缀缎缔缠缴罕罗羞羿翔翠翼耸耻聋聘肆肖肢肪肾脂脊腊腥腮腹膛膜膝臂臣舆舟舵舶艇艾芒芝芦芬芭芳芹苏茂茄茎茧茫荔荡荷莫莲菇菊萌萍董葫葬葱葵蒂蒜蓄蔓蔗蔼蔽蕴蕾薪薯藤蘑虏虹蚁蚂蛛蛮蛾蜓蜘蜻蝉蝗融螺衅衍衔袄裳覆誉誓讥讹讼诈诧诫诱诸诽谎谐谗谤谬谱谴豁豌贝贞贤贩贪贬贰贷贼贿赂赋赌赖赴趋跺踌踪蹋蹦蹭躇躬轧轰轿辐辖辙辨辫辰辽迁逆逊遣邦邪郁郑鄙酌酗酝酶酿钙钦钮钳铀铭链销锋锌锤锦锯锹镁镰镶闸闺阀阁阐陋陶隆隘隙隧雀雁雅雌雹霍霞霸靴鞠鞭韧韵颁颇颈颊频颖颠饪馈馋驰驱驳骡髦魄魔鲁鸦鹊鹰鹿鼠龟黑'),
    (u'Non-HSK', u'')
  ]



# Provisional list of radicals, more to follow
hanzibyradicals = [
    (u'214 Radicals', u'一丨丶丿乙亅二亠人儿入八冂冖冫几凵刀力勹匕匚匸十卜卩厂厶又口囗土士夊夊夕大女子宀寸小尢尸屮山巛工己巾乡广廴廾弋弓彐彡彳心戈戶手支攴文斗斤方无日曰月木欠止歹殳毋比毛氏气水火爪父爻爿片牙犬玄玉瓜瓦甘生用田疋疒癶白皮目矛矢石示禸禾穴立竹米糸缶网羊羽老而耒耳聿肉臣自至臼舌舛舟艮色艸虍虫血行衣襾見角言谷豆豕豸貝赤走足身車辛辰辵邑酉釆里金長門阜隶隹雨靑非面革韦韭音頁凬飛食首香馬骨高髟鬥鬯鬲鬼魚鳥鹵鹿麦麻黃黍黑黹黽鼎鼓鼠鼻齊'),
    (u'RtHZ Components', u''),
    (u'Non-racial', u'')
  ]


# Taiwan's Ministry of Education published list 常用國字標準字體表
# (Chart of Standard Forms of Common National Characters)
# consisting of 4808 characters 
# Level 1:  198
# Level 2:  166
# Level 3:  267
# Level 4:  351
# Level 5:  421
# Level 6:  548
# Level 7:  616
# Level 8:  956
# Level 9:  2042
# short-name to be Taiwan Standard 
hanzitaiwanstandard = [
    (u'Level 1', u'一人下上大子小不中天心水出生地如年有自事來長為面家氣起高動國得開道學以可用多好和所後是時著過說了去在沒到要能做常就樣個又他的這也很外同成作發會知對點看等想我候都最花那還麼你三分方日打老物書然二而定果前間當十叫因從現像種裡們意回些力公手西車明情頭見走東經話樂比把體兩快正才太吃真給第覺只每山白兒聲本美帶進位使之行法次弟寫跟色電字於表愛問錢邊聽再完幾但名身風月全放路別己相什早文合重理喜或工四被媽爸部'),
    (u'Level 2', u'直空變師友歡各無音球數興已拿讀口平加活原畫實應海先住教處難今課五校她眼女望親少跑光衣服接清場新父向期許玩朋呢由星視讓主通運六形妹哥坐條安門馬機受飛病笑感節樹告記請件它買隻午怎內民其王考飯母習孩死神信紅魚亮立嗎世百房張結功非便晚並金木代業語元容將此連睡怕火河雨食關總更且指量目報滿故遠班類題答化度往八反交利紙強解管精九具害跳麗幫找號流片收夜界苦陽照遊希'),
    (u'Level 3', u' 半步保倒熱包整姊古林算與輕器較計牠入性軍菜園燈歌注土南忙該北失皮草黃近假唱排船試臺始共命隊黑送乾養久認思圖論觀卻雖社賽石特華傳任念士毛筆萬禮七級造青客香影助改穿息停傷演講醫越慢句建提言義葉戰鳥必喝趕吧升市品育屋求室轉除訴足院雲腳男奇英掉備景象綠緊辦錯識壞庭政稱婆細落圓者取裝決肉休刻易根離藥練角積千夫布春亂田周約終例響員線產示牛守何呼參溫選戲護忽剛準趣敢漸夠及式狗極奶設啊首料段酒深底尺省居板單消留隨哪令血油城費存怪急洗破勞痛農舞談舉謝塊敬鐘旁換歲賣靜臉詞官至阿餐街爺調切呀則哭科商集背座統達蟲忘持願驗誰拉味救童鄉順福環雙站討灣努睛'),
    (u'Level 4', u'冷夏游漂朝右區爭斷鐵止左治務專推復短領究竹規需秋負吸您盡伯架搖導依健康境操燒爬沙差野腦雞永桌遇引狀製叔曾詩吵展簡府史格程圍床術似組項里德未米善群鼓團責增兵殺票察樓寶乘淨潔續係曲洋堂牙良店待茶彩勝鬧顧免吹困汽旅靠查江甲姓制眾惡般低紀替另耳司局防枝射散辛顏朵拍兄投齊懷充龍冰灰羊洞浪針敗富雄險幸缺速棒鮮價初列適抓置乎端瓜夢廣掃植質玉絲盤豆基頂固研族刀李貨貴嘴橋藏姑杯染煩晨某警貓弄志泥修彈糖臨驚冬危孝勇突追零賞擔昨巴迷陳聞衛抱堆涼陸優避幼捉慣肯支罵琴確密祖絕章標伸互台啦骨克須附營藍材蛋武拜珠暗輪壓序季革值烈閃掛減嚴煙退麻寒蓋壯娘益勤誠鞋偉惜搬績顯即裏戶滑忍陣窗勢莊孔素供印微資擊態楚鬼婦盛漢姐末胡若配議岸熟織泳屬舊財軟閒躲登髮派銀帝偷預層辭陰尊敵村瓶騎嚇孫虎封付袋途箱激繼彎肚懂兔雪翻池紛採鄰麵否奮醒剩'),
    (u'Level 5', u'冒甚仍煮測尚縣堅寬劇聯檢獨據犯俗粉招案圈異補廠迎哈述幹牆按烏技攻胞歷肥模巧刺拔湯鼠榮鼻暴館卡抗束訓累超載旗恐祝碰餓含乙壁珍智舒暖隔獎衝擦鬆廳露液施際濟丟維況份竟佛鏡律尤蝶湖典源歸靈限波毒鬥弱揮鉛誤鋼蘇概讚粗介抽柔借摸豬輸繩欣猜碗稻忠斤伴妙噴戴陪踏聰沈職雜娃尾郵盒脾寄透圾酸蟻凡型皇效腿棵剪折厚套權慶亡尖君松怒脫飲塞貝奔泡挑逃淡創悲掌厭憂撞默擺佩畢既髒愉顆倍致島窮恨捕喊郊羅玻偏棉鈴頓廢璃槍吐汗帽筒豐勸飄享抬捨椅籃輛餘錄洲罪藝移硬率疑遺繁構燃螞私均齒範偶爾揚森轎桃蘭探符威殘羽損釣距降雅禍災淚猛滅飽滴貌箭舅篇獻蜜仁仙溜聖刷姿棄甜貼播潮遲粒奏沖欺廚擠紹勵頁蝴宗證曆婚釋哇築幻斯徒填縮橫丈污徑普獲遍糕昏亞愈輝碎爽莫訪殼廟輩侵宮腰繞敲暑慰卷耕梯餅鎮晴垃丁孤甘秀宜倫惠週溝擇鴨貢跌搶懶疼恩耐憐潑乖編振秦薄階塗略禁墨妻觸儀插溪沿混聚抵阻縫番汁邦胖核港批股疾副幕銅鍋坡遭牽宣炸握劉濕扇鹿博晶搭獵姨幅膀牌雷吳夾奉拖訂臭隆寧漆蓮賴慕辨匆描摘憶賺州朗燭咬捐筋慧'),
    (u'Level 6', u'仔鹽斑礦患秒裳磨虛隱京延柱胸逐央穀僅哦浮垂納斜緣穩承麥迫桶逛澡蕉吉蓄評獸眠怨慮罩仰臣盆閉糊爛仗促疲詳儲鵝恢膽谷苗蜂窩埋笨割漫賢簿傲嘗咪巨扶炎滾駕籠扮勉拾悟渴騙驕牲踢譬佳慈祥飾颱祭慨謀彼碼執複憑歪梅稍蒸孟菌喪屈旋淺秩索尋監獅噹瓦席井判唐臂宋挖融闊協匪占貧寸川庫震叢灌猴肩愁蒼糧蠟弓純衡蛙頑儘網呆冠悶棋醉寂淘慌躺腸狂芳啟蛇楊津敏淋傘誇瘦擁穫遵夕吞漁撲諒謂氧溶括妳干劃喻委跡烤喔策舍韓毫撿尼黨歐佈罷膚紫塵覆緒豪籍壘荒膠芽袖幣魯眉奪厲疊劑岩映郎航捲稀慘腐撥濃譽串巷翅罰汪澆培嫁障枯釘嘉魔鑽聊熊蝦閱曉臟伍悄狼采胃喉淹雀矮爆罐悔拳拼燙灘款駐蔣暫徵裂猶叩蒙紋耀版稅額系貫遷縱域殖藉踐授攝恥牧炮燕塑擴仿億伏舌斗旦戒赤柳泉紗壽鳴摩緩騰巾兇侯哲傑賀哀胎爐竿擋競泄肌幽挺荷療艱齡恰羞貪陶梨鍵宇寺扯牢抖倦渡遙鄭駛轟趁羨摔筷嘻翁霧茫惱磁謙挾側陷氏殊呈諸冊欲腔舟砲梁裁惰宿疏劍雕螺辯乏拒循憤擾繪蘿鷹叮炒虹扣愚稿佔抹柴嫩趙鴉虧贈睜賓褲扁控笛滋購嫂寞坦症敘桿匹悅瘋欄躍划窄脆嬰仇柏暢糾鞭狠喚糟蚊蟹踩焦綿伙侍咕畏挨堪碌翠鍊灑稚犧黴丹嬌娛綁諾亦韻衰刑售傾盲乃辱毀繫迅俄帳託盜欠崇紮肅鳳卵桂違尿役皆痕譜耶脖螂乞昆朱塔漏遮慎黏謹邀勁廉魂准悠戚歇僕徹誕櫃簽覽砍瞧咐瑰托巡洪撒伐后宏姆恆耍倉屑壺湧惹迪倆鈔肝泰奧爪添愧塘譯坑峰抄販矩捧喘闖劣'),
    (u'Level 7', u'傍龜搜腹泛蠶螢犬拘溼械懸脈凝珊恭漠蕩啞唯綜曬乳祇租拋宴遞漲銷兼申媒惑棍葬墳礙贊襲芬援逼肺嫌懼奴袍狹遣蔬曹盼摺餵刊扭杜漿薪鎖召臥悉絡誌撫樸橘杆玲寓唉榨皂燥娥嘩謎砂鋒磚勾呵昌昂昇妨郭翔歉芒徐浴廊盪矛盾蹟囊譏莖鋪晉祕鋸畜督蹴旨醜纏碳晒肢艇銳蔔披晃墓哩彿頸棟湊輔籌浸蕭茂捷賭枚屍潛蹤莉逗董翹襯澈闢蜓征逢瑞碧閣錦翼于扎吾刮析返缸掙葡誓霞醬攤攪廁玫琳奸押嘆蓬吟拆枕泊盈凍迴堡敦脹腫鉤馳槽賠嶺咳匙晝廈慚懇瞪謊嘛吩傻裕壤陌儉敷賜氛哎帆跪蹈企訟軸丙妖盟賊脊惟獄綱轔予措蔡削潤澤酬衫殿邪炭債裙鍾彷宅亭棚娶凹潭邱丸劫宰夥艦蘆估旺榕勒栽脅盞贏旱揭渾扔卑丘奈秘酷謠鴿盯匠勃墊蠅廷併哄屏淒凱註誼錶魏癢蠻叭岡挫撐墾憲澳熄顛枉暈浩喇診宙嚕囉溉歎俊昭榜佑嬸審脂煤紡瓷蝕硫弦冤膜柄禽誘崗掩喬坊妥涉秤陵鑿胳豈徽蟀蟋鱗帥仲忌銘橡臘凸僑挽裹蜻咱紐偽儒簧玄桑兆瓣飼鏟絨萊杖泣誦允吱洩埃梳滔槓鬍礎嫦螃株霜岳叛洛巢媚償糞豔歹眨萄蘋侮俱彰跨聳訊拱俯躬飢菊催黎濫秧撕鍛箏吼緯孓凶賤嘟屆擲姻穴纖契瞭鯉蟑鏈截署駝蟬嗡敝貿禾姜寡陋綴斥吏邋戀叉耗絮薩攏嚼驅屁峪伊腺辰柯棲勿鹹揉疆猩剝宵怡軌捏喧煉鄙瞎蹦芭祈筍蛛皺頰穗饒櫻喲蜘闆焰澄繳攔址毅燦攜匈哼濱凌淑茄陡薯禱茅逝啼遼邁寵霸耽嘲耘嚨涕泌雉廿趨擱殷顫艾鬚娜絃雌冕帘繡僧兮甫睦迸膝軀醋偵奢掀頌熬緻鋤吻妝框掘撤綢銜豎錫襟孕襪蕃頻丑岔搗僻鯨躁聾咚浙狐怯咽栗竭赫堵蔗繃唸傢俠衍慾碩澎嚮嚷煞拌嘿訝嗨倡狸碟搞暮吊朽芝烘焚彌伶呂煌懈逍喂毽颳巫婉溺帕洶欽嬉藹暉'),
    (u'Level 8', u'錐撮纔賦鑲醱庸抑氫恕皿褐醮盧鏃竊樞澱鹼頗勻逸斧詢蒲緞璧姪尉堤凳禦粽寢妒膏濁啄禿媳瑚舜卜戈腕煎碑劈潰曠余蚓淇蚯橙趟卿豹菲艙濛藤拓峽噪爍嶼崩札冶喳毯隋餒駱鞠骯崖梭叨哨瑪扛咖啡傅萍楓膩櫥馨俘徊倘瀑鵑鏢鉋鼎汙蔽蔓邑彫雇曰沉募鬱詐妄沸荊匯隙稽沾洽粹簷驟鏽逆弔杏券倚脣辣悼棺鰭稷艘諧龐寇壇攀貯肪鶴冥弊蹄驢罕陝蹲曼斬蔭呱茉唷娟葛夷佐剖唇茲屠棗粥溢輯扒沃拇俐哉凋晏爹袁梢敞棧萎屢翩戳簾禹崑頃琵琶嗽骼塌癌矢嗜埔唧嗓牡峻奠搓濤怖卒拂赴樑鴻剎軒凰涯琅棕嗚嘔綽潦擅瀝鷗柿趴辜葦餃槳憾掏鑰羿撈鋁卓苔頒蔚甩濺幡喫酉鏜郾烹釆瀋癡赳搧爵髓匣顎鏤祀桓畝刃婿擬韌馴瑣藺昧縷藻卦范哺閥攙釀菱瓏衷御淵貸遜騷鑼淪廂菩鈕遂瞞籤阮塾囑乒弧兜鑑毋疹耿摧滲窯豫蘊摟穌喃疫幢拐貞惶渣酥猿瑟丫沫侶訣搏肆蜀撇誨僵寮咻笠楣餌徘犄齣汝汰蛀渺菁嫉腮懦竅丐倩圃捆砰廖蚣蜈曳琉詹瞬癮鷺賈咯韋榴霉穎崙懊嚥拯虫鏝鏘阜彭曝蕊矣卅苛淫履苟庶莽孽酌焉趾椎稜箕蓆廝撓黛戊菸餞軻胚轄肴嬴灶函歧勘椒雁聘篤霍禪籬云腎締縛矯篷簫礫瑜孵朦朧拙掠舵粟祿裸攘饑兀伺肘咒妮砌虐揀棘膨諷鮑曜辮黯几晰隄嗅卸垢蛾墜瘤蔥穆靡麟旬臼侈帛昔屎苞桐彬梧涵淮鈍慷嘰撰頹檀檯穢薰矇繭蠢恍眶莢釦痺誡樁噸糙駿颼瞇嗯絞羹跋痰蕪乓蚱佰柵疤紳渦皓馮噓蕾瞻邏欖杭莓嚐柚鏖疸鏑糸坎霄奄咸啃逞睹嘮檔礁屜皎窒琪蒐瑩鯊汴沂愣帖瘡唆膊懲鵲筏稠箇酵餡訢駁鑄尸妓狡梗筐黍窠摹薦壩硼霆甌簍邵埂擷郡濾炊雯瑾衙筵簇磅囚眷暇滯魄翰齋屯秉剔荼訛婷犀碘葵虞廓槌滌熔蒜磊勳髻氈隸竄藩甸肛拴祠紊悽烽斟煦嘈幟憫緬檻鐺冉炕蛹隧姦腥夭卯沼梓鈞窪閩駭糠闌亥絹彆蹺荀飪弛覓倔畔虔兢嘍嚏羲揍蒂鶯仕弘沛宛庚郁涎豚堯湘漓綸肇凜墮撩夸吶呻坷惺揪蛻跤噎薇鵬繽跺踴晾睏墅蜿嚀絏艷潘亨抒狄俏彥嗦垮悵痘蝸霓瞰瞌瀰蜢咦槃砝兗鏍隹鹵詭帚芥硝猾斂愆醃橢魑粱忿匿貶稟窟賄閨賬贅咎俸捻氯鈣嗣葫磕醇熾頤輿瀾驛妾蚌梵璋蝨褒鴦鴛窿鼬襖鰻癲鈸螳缶唾鳩魁瀉轍肋吝庇忱扼沐汲剃怠峭恣殉婢袒揣硯萌楷詰嗶綻誣碾褥膿褶錘檬檸臍簸贖鬢韭烙嵌徨菠跛閏熨稼樺諜輾殯餾麓姥紂滓軾龔蘸騫灼窺甥渠閑匡夙佣刨肖陀宦茹帷犁喀詠鉅漾綵蓉嘶樟橄擎斃糜襄闔鑒丰仄侃咀氓姚倭狽笆愷粵虜幔漣瞄噗癟蠕鰓顱氾斛詣漩骰鞏蹋亢乍妃刪吠扳芋拭浦惕眺絆缽羚莎彙椰煥遐靖熙廬佃坪杰穹倖悚祟蚪唬崎淳淅啾揩揖蛟貳榔痲綑僥樊膛蝌撼篙嬤瀟隴鸚芯閔滕燼鞦饅鰍巔吋渤祺矗'),            
    (u'Level 9', u'拚芹茁餚蹇挪鈉砸誅豁謬粧勺圭兌豕軋悍氨晦厥蛤搔裘辟榻諱踵濯澀瞳釐牘攬沌紉紇捎涓逕戟琢漬瘩蝗篡錠篾謗伕迄舀痠嗇耒鞅憔俺蟯犰靴孜姬茸遏靶寥髦摯膳錨坍怔冑惋舶莒傀詔滷銲簌騾讒躡驪抿咨楞瓊刁戎杉汞拗炙芙芸剋恬殃倣朔眩胰偃匾釵孳寐氮腋傭榆溯滄瑕睫逾鉗雍嘎漱瑤綺餉嘯墟瘠緝諫閻孺嶽薛雛藕礬囂巖纜鸞尹朴伽妞杓沮峙柩苑哽挈桅砥耙茵蚤寅徙惘敕聆脯壹掣逮馭瑯瘁睬裔摻榛撬澗緘鄧褪踱壕磯縹蟆遽黝瀆蹙繹譁麒曦巍巒霽攣籮匕爻卉丞忪枴倪浹畚淞痙袱剷徬臧嘹噯薔贍韆酗捶筧憧踫櫓躪叼珮罣坤壑俞痴箸踞擂屹吭竺炯啪悸湃僱潺擄瘴瀚嗆楠舔壢蘚蝠翱悛翾鎔尪寨矽剌芻娼隅鉀隕嫡憎毆篆鋅鍍贓汎佻徇珪毬諂燐殮臀鴃縴餽瓤籲姒佗糨僚鵠并蜷靛饞巳藷殳鎗叱吁牟迂侖庖弩沽咧咿恃恤栓涔淤淆疵盔赦喙惻窘萃証貽酣嗟慄遁酪隘嶄槐箋褂銖鳶蔑鞍駟擒燎瓢縐謁諭鞘骸鬨濡臆膺蹊癖譎竇癬癱羈匝弗疋戌舛岐杞姍沱泗疙疚盂奕恫柬殆盹籽苒迭閂厝奚胯荏偕埠掖旌晤淙眸舷嵐窖絢塢牒瑙綏馱僮幛瘧箔綾輓瘢磋諄踝閭噩澹瘸篩螟鴣儡櫛禧繆薑褻闈騁繕藐鎚鬃壟瀕疇蹶鶉嚶礪纂癩鐲孿蠹釁鑾丕朮艮阡囪咩舢奘胱陛惦惚掄捺粕蛆湄稈筑楨筠葆詫賂鄒睿撢豌樽諺錳醣瀏鯽籐譴髏饕鰾齲劾徠悴惆捱揹蛔肄雹慫骷噢懋瀘鷥螄廾圳瓠逖痣鉑湉墩柑桀啤湛聒剿愴駒霖鏗儷仆叵亙旭佇孚冽拄狙祁柢炬癸迥娓恙栩盎砧訖偎倏扈涸畦痊硃笙愕扉棠剽嶇榭漪犒賑嫻頡憩憊樵燄縈蕈諦檜谿檳癒繚譚糰醺霹懿轡靄吒戍抉阱杷枇姣蚩淬渙琦甦腱滬蓓緲緹諉熹濘璨螫鵡鐮儼靨壬仟拎唏烊啕漳閡蝙遨瞼齬顥蒿轂榫箝謄舂皴椴踉矜孑戾罔拽拷耆猥腑飭葷釉閘嘖輻錚駢磷簪邇闕蟾麝忖攸狎俎玷眇胥迦迢俾娩悌涅窈舐茴衽莘蛉袞斐焙痢媾搪睢稔裊賃熒睽蜥誚賒諛赭銬儕壅轅鎂黜襠癥蘑闡鐸鷂韃吆囤灸牴娉涮窕啻鈐閎飧猷睪蓊遢銨憚暱橈褡諮頷曖覲糯蠣襬蠱鱔鬣妯陂娌啁跆蜊瘓蓀諼檮蠍蠡黷綃嘬噲尢禺鍔鐳噭么佯拈杳邸垣炳冢悖晌祚荐袂崔庵焊貂幌畸煽戮瞑髯寰罹霎擘甕蟠馥鱉纓仃厄汀牝妣妍岑岌佬剁咋杵杪泱俚咫垠奎宥毗炫狩盃盅竽胛胝苓苯叟哮屐峨疽祗紜羔舫荔茱茨訐訕釜啖堊孰戛淌笞翎訥赧喋媛愜摒棹渭湍渝湎翕腓腴菰訶軼塭愾暄滂蜃詼詮賅鈿嘀塹嫖嫣幗慟槁漕禎翡輒銑韶潸皚褓褊諍踟輟輦魅冀噤噬瞥蕨靦嚎嬪曙燴獰磺翳膾賸麋燻罈邃鎢鎳鎬懵羶羸躇麴懺懾殲躊籟韁驍攫靂顰矚汐尬汨汾芍咆怩泅泠侷氟苜觔訃迤酋倌唔娑氦氤涇珞祐啣圉婪彗悻掬涿猙痍翌莞荻釧傖喟堰渲琺詛跎跚隍戢搽楫煬稞葩氳憬璀蓿駙橇盥磬錙鴕尷檣濬燬褸謐醞攆擻獷薺謨蹣蹬饉騖鯧鵪襤躅夔斕櫺躋齜齦鷓齪邐饜刈羌臾洌洮洫敉偌恿荸幀萇媲毓溥碉榦艋褚嫵撙潼魷暹燉璜瞟縑臻蹂繅臃鍥鍬鍚鮪聶躂齟躑霾鑷窣阢浬偭搆煨蜆嫘閤縵艸岍紿鴟悃恚笄愊掰諢彀橛袤搠螅汛梟遑弋仞彤枸疣秣蛄陬嗉緇遛鴆璣獺韜鑠聿呎迆昊痔硎萋蛐碣膈麾儐彊縞擰鐫齧庠曷紲跼縊籀淀懃迕獃掐裱脛芎垛悁浞埸翊冗咄虱豺梆彪嗤嵩銓瘟駑蕙擢罄犢圩佞佚吮杠沁怏怵怛戕杼杲泯芟亟俟哂囿姘弭拮挂斫柞洱珀紆耄剜唁浚砭砟紕胭胼臬茗陞匐啜唳婁捫烯猖絀脩莠趺弼惴棣渥湮痞竣耋腆菅菽萸蛭詁詆鄂塚搾楔滇睨筮萱萼雋飴匱嗷嫗寤犖甄綬蓑蜴裨鉸鉻颯撳牖箴銻噥噱璞瞠輳霏髭黔檄檐癆鼾穠謫魎魍黠櫚璽藪孀鰥儻囈衢贛鱷鱸迓毳稗蜮攛乩伉仳刎妁汕囫妊沆汶甬肓阪侏侑卹呷坼岫帑忝抨歿沬肱肫匍奐泵牯胤倨俳圄捍朕桔涌痂皋皰砷迺婀婊崢捩旎莧蚵孱愎愀揆湔琥琨皖腌菴飩勦嗑塋媼慍楝溴睞睥蜇貉輊鈷奩愿慵摑斡旖暝榷獐瘍翟蒞靼劊嬋撚樅犛獗誹輜鋇噙曇篦縉褫覦諳遴錮餛鴒嚅嶸濠燧糢糝縲聱薜蟒鮫懣癘穡簣闐颺瀨鏨鯛醴囁矓驀禳躓鑣魘齷黌阨岬徂痀煒摽樗遯嚓卞卮佝呃忸枋玟疝祉苧娠宸峴晁訌軔陘淄淦袈堝嵇幃廄棻湲絰覃逶溧痳絛裟豢鉍嗾裴儂槨潯緙鄱鋰頫麩劓噶氅燜縝蕞踹錕覬蹉邂鍰闋鮭瞿繒邈鯖孃櫬蠔囌臢鱖灞灤釅丌苹恧逑皁枘夯砒莩橐籙鑊鬻籪囔汆芃坨咷耷嘧漚餑蕁瞵儵亹沅呸岷泓玨昱枰柒炤甭迨捌浥盍軏邕釭釩氬湣琯詖嗥僖暨遘噫撾濂璟甍簑鄴鄹壙璿鎘蹼瀲瓖饗酈籥鸛枓舖噁椿粘厘銹蜒伎哆枷恁覷匚忐蝟熏捋謔轆宕僂忤旳坳妺紈笈掂嗔摜閫罅枒觚頇蒔噘鐙顢扙扺剮梏揠椪嗩糗癈酤碴餧豸璇瀠眈胺棱痼摳潢篋圜螓繐泫咭秫莪喁甯菖隉鳧踅儆嶙醍蹚鵓鶻鰲鷙癰襻驤帔怦桉烜瓞罝圇桴欷莨喨喈堞棼渟腄葯酯撂瞅噌撟獢璉箬噠嬗歔擤檁薤螯鎯魈鎧鞫韙蹻騶齎柘涷酚羡搨摁楂楬鉬廒摶槎裰廡槿嚄謚鯪蠑醵颲菹廌蚜勛觴霤驥灴垕徼蹀薏闇駸礡鐐鬟呶弈徉疥虺狷疳荃敖晷楮菟戡溘煖葭貲鉚慇裯誑嶔磐耦銼儔冪嬝耨屨薊螻簞鞣鼕瀛巉罌鐃驃爨囡扦旮汊网芡凄哧粑猗逋硜嵬溷蜍觥跬跣遄嘵鴇閽謾鏦鯢鐿鶼弁刖劬孛坩岱芷恪皈胄苣酊倥倀崁捂桁罟郝崛崧徜梃梔蚶豉軛雩傚剴崴巽愒絳菔蛞賁鈑陲愍楹煆瑛碓裒詬訾酩髡僭膂蜩誥貍儈墀嬈畿瞋羯膘蝓懍撻翮霑壎濮蟈彝瞽薹鎊餿餮襞臚譫霰鼯囀瓔羼鰱鑤讖鑪鱟鼇讜乜尥抔旰杌芊怜旻邯俛敁苕苤恝捅旃栲狺罡惓晢眵酖堙嵫敪矬稂稊詈暌跫慪罳蒻裾潻糅衚鄲醅嶮燋縕蕕諤錛鮒鮐檎蕷貔蹐鎡鍼闃髽聵蟥蹡騑髀鵜繯譊譖鏹饈蠖糲衊鷇鷃扑氐氖妤抆邢兕劻昀昕秈芣俑柙柝洸洵玳畎畋疢娣胴舨衹逅郢匏埤庾渚琊紼耜脰莆逵鈇傯嵯弒暘瑁瘀痿粳萵鉉麂劂塽夤搴摭殤潟箠篌誶賡暸瘺磧檗燠磴繈賻颶櫂臏蹕櫝譙霪譟躉儸曩鼙玀鼴髑髖韉仂菇')
  ]

hanzi500sSimp = [
    (u'Set 500', u'的一是不了在人有我他这个们中来上大为和国地到以说时要就出会可也你对生能而子那得于着下自之年过发后作里用道行所然家种事成方多经么去法学如都同现当没动面起看定天分还进好小部其些主样理心她本前开但因只从想实日军者意无力它与长把机十民第公此已工使情明性知全三又关点正业外将两高间由问很最重并物手应战向头文体政美相见被利什二等产或新己制身果加西斯月话合回特代内信表化老给世位次度门任常先海通教儿原东声提立及比员解水名真论处走义各入几口认条平系气题活尔更别打女变四神总何电数安少报才结反受目太量再感建务做接必场件计管期市直德资命山金指克许统区保至队形社便空决治展马科司五基眼书非则听白却界达光放强即像难且权思王象完设式色路记南品住告类求据程北边死张该交规万取拉格望觉术领共确传师观清今切院让识候带导争运笑飞风步改收根干造言联持组每济车亲极林服快办议往元英士证近失转夫令准布始怎呢存未远叫台单影具罗字爱击流备兵连调深商算质团集百需价花党华城石级整府离况亚请技际约示复病息究线似官火断精满支视消越器容照须九增研写称企八功吗包片史委乎查轻易早曾除农找装广显吧阿李标谈吃图念六引历首医局突专费号尽另周较注语仅考落青随选列'),
    (u'Set 1000', u'武红响虽推势参希古众构房半节土投某案黑维革划敌致陈律足态护七兴派孩验责营星够章音跟志底站严巴例防族供效续施留讲型料终答紧黄绝奇察母京段依批群项故按河米围江织害斗双境客纪采举杀攻父苏密低朝友诉止细愿千值仍男钱破网热助倒育属坐帝限船脸职速刻乐否刚威毛状率甚独球般普怕弹校苦创假久错承印晚兰试股拿脑预谁益阳若哪微尼继送急血惊伤素药适波夜省初喜卫源食险待述陆习置居劳财环排福纳欢雷警获模充负云停木游龙树疑层冷洲冲射略范竟句室异激汉村哈策演简卡罪判担州静退既衣您宗积余痛检差富灵协角占配征修皮挥胜降阶审沉坚善妈刘读啊超免压银买皇养伊怀执副乱抗犯追帮宣佛岁航优怪香著田铁控税左右份穿艺背阵草脚概恶块顿敢守酒岛托央户烈洋哥索胡款靠评版宝座释景顾弟登货互付伯慢欧换闻危忙核暗姐介坏讨丽良序升监临亮露永呼味野架域沙掉括舰鱼杂误湾吉减编楚肯测败屋跑梦散温困剑渐封救贵枪缺楼县尚毫移娘朋画班智亦耳恩短掌恐遗固席松秘谢鲁遇康虑幸均销钟诗藏赶剧票损忽巨炮旧端探湖录叶春乡附吸予礼港雨呀板庭妇归睛饭额含顺输摇招婚脱补谓督毒油疗旅泽材灭逐莫笔亡鲜词圣择寻厂睡博勒烟授诺伦岸奥唐卖俄炸载洛健堂旁宫喝借君禁阴园谋宋避抓荣姑孙逃牙束跳顶'),
    (u'Set 1500', u'玉镇雪午练迫爷篇肉嘴馆遍凡础洞卷坦牛宁纸诸训私庄祖丝翻暴森塔默握戏隐熟骨访弱蒙歌店鬼软典欲萨伙遭盘爸扩盖弄雄稳忘亿刺拥徒姆杨齐赛趣曲刀床迎冰虚玩析窗醒妻透购替塞努休虎扬途侵刑绿兄迅套贸毕唯谷轮库迹尤竞街促延震弃甲伟麻川申缓潜闪售灯针哲络抵朱埃抱鼓植纯夏忍页杰筑折郑贝尊吴秀混臣雅振染盛怒舞圆搞狂措姓残秋培迷诚宽宇猛摆梅毁伸摩盟末乃悲拍丁赵硬麦蒋操耶阻订彩抽赞魔纷沿喊违妹浪汇币丰蓝殊献桌啦瓦莱援译夺汽烧距裁偏符勇触课敬哭懂墙袭召罚侠厅拜巧侧韩冒债曼融惯享戴童犹乘挂奖绍厚纵障讯涉彻刊丈爆乌役描洗玛患妙镜唱烦签仙彼弗症仿倾牌陷鸟轰咱菜闭奋庆撤泪茶疾缘播朗杜奶季丹狗尾仪偷奔珠虫驻孔宜艾桥淡翼恨繁寒伴叹旦愈潮粮缩罢聚径恰挑袋灰捕徐珍幕映裂泰隔启尖忠累炎暂估泛荒偿横拒瑞忆孤鼻闹羊呆厉衡胞零穷舍码赫婆魂灾洪腿胆津俗辩胸晓劲贫仁偶辑邦恢赖圈摸仰润堆碰艇稍迟辆废净凶署壁御奉旋冬矿抬蛋晨伏吹鸡倍糊秦盾杯租骑乏隆诊奴摄丧污渡旗甘耐凭扎抢绪粗肩梁幻菲皆碎宙叔岩荡综爬荷悉蒂返井壮薄悄扫敏碍殖详迪矛霍允幅撒剩凯颗骂赏液番箱贴漫酸郎腰舒眉忧浮辛恋餐吓挺励辞艘键伍峰尺昨黎辈贯侦滑券崇扰宪绕趋慈乔阅汗枝拖墨胁插箭腊粉泥氏'),
    (u'Set 2000', u'彭拔骗凤慧媒佩愤扑龄驱惜豪掩兼跃尸肃帕驶堡届欣惠册储飘桑闲惨洁踪勃宾频仇磨递邪撞拟滚奏巡颜剂绩贡疯坡瞧截燃焦殿伪柳锁逼颇昏劝呈搜勤戒驾漂饮曹朵仔柔俩孟腐幼践籍牧凉牲佳娜浓芳稿竹腹跌逻垂遵脉貌柏狱猜怜惑陶兽帐饰贷昌叙躺钢沟寄扶铺邓寿惧询汤盗肥尝匆辉奈扣廷澳嘛董迁凝慰厌脏腾幽怨鞋丢埋泉涌辖躲晋紫艰魏吾慌祝邮吐狠鉴曰械咬邻赤挤弯椅陪割揭韦悟聪雾锋梯猫祥阔誉筹丛牵鸣沈阁穆屈旨袖猎臂蛇贺柱抛鼠瑟戈牢逊迈欺吨琴衰瓶恼燕仲诱狼池疼卢仗冠粒遥吕玄尘冯抚浅敦纠钻晶岂峡苍喷耗凌敲菌赔涂粹扁亏寂煤熊恭湿循暖糖赋抑秩帽哀宿踏烂袁侯抖夹昆肝擦猪炼恒慎搬纽纹玻渔磁铜齿跨押怖漠疲叛遣兹祭醉拳弥斜档稀捷肤疫肿豆削岗晃吞宏癌肚隶履涨耀扭坛拨沃绘伐堪仆郭牺歼墓雇廉契拼惩捉覆刷劫嫌瓜歇雕闷乳串娃缴唤赢莲霸桃妥瘦搭赴岳嘉舱俊址庞耕锐缝悔邀玲惟斥宅添挖呵讼氧浩羽斤酷掠妖祸侍乙妨贪挣汪尿莉悬唇翰仓轨枚盐览傅帅庙芬屏寺胖璃愚滴疏萧姿颤丑劣柯寸扔盯辱匹俱辨饿蜂哦腔郁溃谨糟葛苗肠忌溜鸿爵鹏鹰笼丘桂滋聊挡纲肌茨壳痕碗穴膀卓贤卧膜毅锦欠哩函茫昂薛皱夸豫胃舌剥傲拾窝睁携陵哼棉晴铃填饲渴吻扮逆脆喘罩卜炉柴愉绳胎蓄眠竭喂傻慕浑奸扇柜悦拦诞饱乾泡'),
    (u'Set 2500', u'贼亭夕爹酬儒姻卵氛泄杆挨僧蜜吟猩遂狭肖甜霞驳裕顽於摘矮秒卿畜咽披辅勾盆疆赌塑畏吵囊嗯泊肺骤缠冈羞瞪吊贾漏斑涛悠鹿俘锡卑葬铭滩嫁催璇翅盒蛮矣潘歧赐鲍锅廊拆灌勉盲宰佐啥胀扯禧辽抹筒棋裤唉朴咐孕誓喉妄拘链驰栏逝窃艳臭纤玑棵趁匠盈翁愁瞬婴孝颈倘浙谅蔽畅赠妮莎尉冻跪闯葡後厨鸭颠遮谊圳吁仑辟瘤嫂陀框谭亨钦庸歉芝吼甫衫摊宴嘱衷娇陕矩浦讶耸裸碧摧薪淋耻胶屠鹅饥盼脖虹翠崩账萍逢赚撑翔倡绵猴枯巫昭怔渊凑溪蠢禅阐旺寓藤匪伞碑挪琼脂谎慨菩萄狮掘抄岭晕逮砍掏狄晰罕挽脾舟痴蔡剪脊弓懒叉拐喃僚捐姊骚拓歪粘柄坑陌窄湘兆崖骄刹鞭芒筋聘钩棍嚷腺弦焰耍俯厘愣厦恳饶钉寡憾摔叠惹喻谱愧煌徽溶坠煞巾滥洒堵瓷咒姨棒郡浴媚稣淮哎屁漆淫巢吩撰啸滞玫硕钓蝶膝姚茂躯吏猿寨恕渠戚辰舶颁惶狐讽笨袍嘲啡泼衔倦涵雀旬僵撕肢垄夷逸茅侨舆窑涅蒲谦杭噢弊勋刮郊凄捧浸砖鼎篮蒸饼亩肾陡爪兔殷贞荐哑炭坟眨搏咳拢舅昧擅爽咖搁禄雌哨巩绢螺裹昔轩谬谍龟媳姜瞎冤鸦蓬巷琳栽沾诈斋瞒彪厄咨纺罐桶壤糕颂膨谐垒咕隙辣绑宠嘿兑霉挫稽辐乞纱裙嘻哇绣杖塘衍轴攀膊譬斌祈踢肆坎轿棚泣屡躁邱凰溢椎砸趟帘帆栖窜丸斩堤塌贩厢掀喀乖谜捏阎滨虏匙芦苹卸沼钥株祷剖熙哗劈怯棠胳桩瑰娱娶沫嗓蹲焚淘嫩'),
    (u'Set 3000', u'韵衬匈钧竖峻豹捞菊鄙魄兜哄颖镑屑蚁壶怡渗秃迦旱哟咸焉谴宛稻铸锻伽詹毙恍贬烛骇芯汁桓坊驴朽靖佣汝碌迄冀荆崔雁绅珊榜诵傍彦醇笛禽勿娟瞄幢寇睹贿踩霆呜拱妃蔑谕缚诡篷淹腕煮倩卒勘馨逗甸贱炒灿敞蜡囚栗辜垫妒魁谣寞蜀甩涯枕丐泳奎泌逾叮黛燥掷藉枢憎鲸弘倚侮藩拂鹤蚀浆芙垃烤晒霜剿蕴圾绸屿氢驼妆捆铅逛淑榴丙痒钞蹄犬躬昼藻蛛褐颊奠募耽蹈陋侣魅岚侄虐堕陛莹荫狡阀绞膏垮茎缅喇绒搅凳梭丫姬诏钮棺耿缔懈嫉灶匀嗣鸽澡凿纬沸畴刃遏烁嗅叭熬瞥骸奢拙栋毯桐砂莽泻坪梳杉晤稚蔬蝇捣顷麽尴镖诧尬硫嚼羡沦沪旷彬芽狸冥碳咧惕暑咯萝汹腥窥俺潭崎麟捡拯厥澄萎哉涡滔暇溯鳞酿茵愕瞅暮衙诫斧兮焕棕佑嘶妓喧蓉删樱伺嗡娥梢坝蚕敷澜杏绥冶庇挠搂倏聂婉噪稼鳍菱盏匿吱寝揽髓秉哺矢啪帜邵嗽挟缸揉腻驯缆晌瘫贮觅朦僻隋蔓咋嵌虔畔琐碟涩胧嘟蹦冢浏裔襟叨诀旭虾簿啤擒枣嘎苑牟呕骆凸熄兀喔裳凹赎屯膛浇灼裘砰棘橡碱聋姥瑜毋娅沮萌俏黯撇粟粪尹苟癫蚂禹廖俭帖煎缕窦簇棱叩呐瑶墅莺烫蛙歹伶葱哮眩坤廓讳啼乍瓣矫跋枉梗厕琢讥釉窟敛轼庐胚呻绰扼懿炯竿慷虞锤栓桨蚊磅孽惭戳禀鄂馈垣溅咚钙礁彰豁眯磷雯墟迂瞻颅琉悼蝴拣渺眷悯汰慑婶斐嘘镶炕宦趴绷窘襄珀嚣拚酌浊毓撼嗜扛峭磕翘槽淌栅颓熏瑛颐忖'),
    (u'Set 3500', u'牡缀徊梨肪涕惫摹踱肘熔挚氯凛绎庶脯迭睦窍粥庵沧怠沁奕咙氨矗盔拇沛榻揣崭鞘鞠垦洽唾橱仕蜘痰袜峙柬蝉蟹谏鹃擎皓朕疤禺铲酶钝氓匣弧峨锥揪杠吭崛诬冉抒庚悍靡晦醋壕锯夭咦侈婢猾徘硝煽皂舵嗦狈靴捂疮郝苛秽茜搓芸酱赁檐饷蕉铀苔赦缎舷筷朔婪紊厮婿寥兢糙卦槐扒裴祀埔絮芭屉痪霄绽宵邑霖岔饵茄韧琪邹瑚憋殆噜忒忿衅淳悖髦孜粤隘濒铮畸剔坞篱淀蓦唬锣汀趾缉嫦斟鞍扳拴诅谟呃懦逞犁忏拧亥佟叱舜绊龚腮邸椒蔚湛狩眶栈薇肮瀑渣褂叽臀妞巍唔疚鲤戎肇笃辙娴阮札懊焘恤疹潇铝涤恃喽砌遁楞阱咎洼炳噬枫拷哆矶苇翩窒侬靶胰芜辫嚎妾幌踉佃葫皖拽滤睬俞匕谤嗤捍孵倪瘾敝匡磋绫淆尧蕊烘璋亢轧赂蝗榆骏诛勺梵炽笠颌闸狒樊镕垢瘟缪菇琦剃迸溺炫惚嗨陨赃羁臻嘀膳赣踌殉桔瞿闽豚掺沌惰喳椭咪霎侃猝窖戮祠瞩菁躇佬肋咄忡雍忱蕾跄硅伎炊钊蝠屎拭谛褪丞卉隧茸钳啃伢闺舔蹬挛眺袱陇殴柿梧惺弛侥琛捅酝薯曳澈锈稠眸咆簧鸥疡渎汲嬉脓骡穗槛拎巳邢廿搀曙樵隅筛谒倭痹猖佯肛奚甭抨蛾唠荧嵩漱酋攘诘篡睿噩怅盎徙鞅漓祟睫攸翎呛筐堑檀寅磊驭惘吠驮瑙炬痉曝恺胺萤敕筝幡霹竺烙毗鸠埠蒜阜嘈乒帷啄鳌毡阙褥搔笋冕狞韶骼蔼烹奄嫖沐噗岑蛟掳咏弩捻圃孚悴诣呱祁捶钠袄澎氮恪雏撮堰彷鹦晖犀腑沽橄掐亵龋嗒咀祺锚')
  ]


hanzi500sTrad = [
    (u'Set 500', u'的一是不了在人有我他這個們中來上大為和國地到以說時要就出會可也你對生能而子那得於著下自之年過發后作裡用道行所然家種事成方多經麼去法學如都同現當沒動面起看定天分還進好小部其些主樣理心她本前開但因隻從想實日軍者意無力它與長把機十民第公此已工使情明性知全三又關點正業外將兩高間由問很最重並物手應戰向頭文體政美相見被利什二等產或新己制身果加西斯月話合回特代內信表化老給世位次度門任常先海通教兒原東聲提立及比員解水名真論處走義各入幾口認條平系氣題活爾更別打女變四神總何電數安少報才結反受目太量再感建務做接必場件計管期市直德資命山金指克許統區保至隊形社便空決治展馬科司五基眼書非則聽白卻界達光放強即像難且權思王象完設式色路記南品住告類求據程北邊死張該交規萬取拉格望覺術領共確傳師觀清今切院讓識候帶導爭運笑飛風步改收根干造言聯持組每濟車親極林服快辦議往元英士証近失轉夫令准布始怎呢存未遠叫台單影具羅字愛擊流備兵連調深商算質團集百需價花黨華城石級整府離況亞請技際約示復病息究線似官火斷精滿支視消越器容照須九增研寫稱企八功嗎包片史委乎查輕易早曾除農找裝廣顯吧阿李標談吃圖念六引歷首醫局突專費號盡另周較注語僅考落青隨選列'),
    (u'Set 1000', u'武紅響雖推勢參希古眾構房半節土投某案黑維革劃敵致陳律足態護七興派孩驗責營星夠章音跟志底站嚴巴例防族供效續施留講型料終答緊黃絕奇察母京段依批群項故按河米圍江織害斗雙境客紀採舉殺攻父蘇密低朝友訴止細願千值仍男錢破網熱助倒育屬坐帝限船臉職速刻樂否剛威毛狀率甚獨球般普怕彈校苦創假久錯承印晚蘭試股拿腦預誰益陽若哪微尼繼送急血驚傷素藥適波夜省初喜衛源食險待述陸習置居勞財環排福納歡雷警獲模充負雲停木游龍樹疑層冷洲沖射略范竟句室異激漢村哈策演簡卡罪判擔州靜退既衣您宗積余痛檢差富靈協角佔配征修皮揮勝降階審沉堅善媽劉讀啊超免壓銀買皇養伊懷執副亂抗犯追幫宣佛歲航優怪香著田鐵控稅左右份穿藝背陣草腳概惡塊頓敢守酒島托央戶烈洋哥索胡款靠評版寶座釋景顧弟登貨互付伯慢歐換聞危忙核暗姐介壞討麗良序升監臨亮露永呼味野架域沙掉括艦魚雜誤灣吉減編楚肯測敗屋跑夢散溫困劍漸封救貴槍缺樓縣尚毫移娘朋畫班智亦耳恩短掌恐遺固席鬆秘謝魯遇康慮幸均銷鐘詩藏趕劇票損忽巨炮舊端探湖錄葉春鄉附吸予禮港雨呀板庭婦歸睛飯額含順輸搖招婚脫補謂督毒油療旅澤材滅逐莫筆亡鮮詞聖擇尋廠睡博勒煙授諾倫岸奧唐賣俄炸載洛健堂旁宮喝借君禁陰園謀宋避抓榮姑孫逃牙束跳頂'),
    (u'Set 1500', u'玉鎮雪午練迫爺篇肉嘴館遍凡礎洞卷坦牛寧紙諸訓私庄祖絲翻暴森塔默握戲隱熟骨訪弱蒙歌店鬼軟典欲薩伙遭盤爸擴蓋弄雄穩忘億刺擁徒姆楊齊賽趣曲刀床迎冰虛玩析窗醒妻透購替塞努休虎揚途侵刑綠兄迅套貿畢唯谷輪庫跡尤競街促延震棄甲偉麻川申緩潛閃售燈針哲絡抵朱埃抱鼓植純夏忍頁杰筑折鄭貝尊吳秀混臣雅振染盛怒舞圓搞狂措姓殘秋培迷誠寬宇猛擺梅毀伸摩盟末乃悲拍丁趙硬麥蔣操耶阻訂彩抽贊魔紛沿喊違妹浪匯幣豐藍殊獻桌啦瓦萊援譯奪汽燒距裁偏符勇觸課敬哭懂牆襲召罰俠廳拜巧側韓冒債曼融慣享戴童猶乘挂獎紹厚縱障訊涉徹刊丈爆烏役描洗瑪患妙鏡唱煩簽仙彼弗症仿傾牌陷鳥轟咱菜閉奮慶撤淚茶疾緣播朗杜奶季丹狗尾儀偷奔珠虫駐孔宜艾橋淡翼恨繁寒伴嘆旦愈潮糧縮罷聚徑恰挑袋灰捕徐珍幕映裂泰隔啟尖忠累炎暫估泛荒償橫拒瑞憶孤鼻鬧羊呆厲衡胞零窮舍碼赫婆魂災洪腿膽津俗辯胸曉勁貧仁偶輯邦恢賴圈摸仰潤堆碰艇稍遲輛廢淨凶署壁御奉旋冬礦抬蛋晨伏吹雞倍糊秦盾杯租騎乏隆診奴攝喪污渡旗甘耐憑扎搶緒粗肩梁幻菲皆碎宙叔岩蕩綜爬荷悉蒂返井壯薄悄掃敏礙殖詳迪矛霍允幅撒剩凱顆罵賞液番箱貼漫酸郎腰舒眉憂浮辛戀餐嚇挺勵辭艘鍵伍峰尺昨黎輩貫偵滑券崇擾憲繞趨慈喬閱汗枝拖墨脅插箭臘粉泥氏'),
    (u'Set 2000', u'彭拔騙鳳慧媒佩憤扑齡驅惜豪掩兼躍尸肅帕駛堡屆欣惠冊儲飄桑閑慘潔蹤勃賓頻仇磨遞邪撞擬滾奏巡顏劑績貢瘋坡瞧截燃焦殿偽柳鎖逼頗昏勸呈搜勤戒駕漂飲曹朵仔柔倆孟腐幼踐籍牧涼牲佳娜濃芳稿竹腹跌邏垂遵脈貌柏獄猜憐惑陶獸帳飾貸昌敘躺鋼溝寄扶鋪鄧壽懼詢湯盜肥嘗匆輝奈扣廷澳嘛董遷凝慰厭臟騰幽怨鞋丟埋泉涌轄躲晉紫艱魏吾慌祝郵吐狠鑒曰械咬鄰赤擠彎椅陪割揭韋悟聰霧鋒梯貓祥闊譽籌叢牽鳴沈閣穆屈旨袖獵臂蛇賀柱拋鼠瑟戈牢遜邁欺噸琴衰瓶惱燕仲誘狼池疼盧仗冠粒遙呂玄塵馮撫淺敦糾鑽晶豈峽蒼噴耗凌敲菌賠涂粹扁虧寂煤熊恭濕循暖糖賦抑秩帽哀宿踏爛袁侯抖夾昆肝擦豬煉恆慎搬紐紋玻漁磁銅齒跨押怖漠疲叛遣茲祭醉拳彌斜檔稀捷膚疫腫豆削崗晃吞宏癌肚隸履漲耀扭壇撥沃繪伐堪仆郭犧殲墓雇廉契拼懲捉覆刷劫嫌瓜歇雕悶乳串娃繳喚贏蓮霸桃妥瘦搭赴岳嘉艙俊址龐耕銳縫悔邀玲惟斥宅添挖呵訟氧浩羽斤酷掠妖禍侍乙妨貪掙汪尿莉懸唇翰倉軌枚鹽覽傅帥廟芬屏寺胖璃愚滴疏蕭姿顫丑劣柯寸扔盯辱匹俱辨餓蜂哦腔郁潰謹糟葛苗腸忌溜鴻爵鵬鷹籠丘桂滋聊擋綱肌茨殼痕碗穴膀卓賢臥膜毅錦欠哩函茫昂薛皺夸豫胃舌剝傲拾窩睜攜陵哼棉晴鈴填飼渴吻扮逆脆喘罩卜爐柴愉繩胎蓄眠竭喂傻慕渾奸扇櫃悅攔誕飽乾泡'),
    (u'Set 2500', u'賊亭夕爹酬儒姻卵氛泄杆挨僧蜜吟猩遂狹肖甜霞駁裕頑於摘矮秒卿畜咽披輔勾盆疆賭塑畏吵囊嗯泊肺驟纏岡羞瞪吊賈漏斑濤悠鹿俘錫卑葬銘灘嫁催璇翅盒蠻矣潘歧賜鮑鍋廊拆灌勉盲宰佐啥脹扯禧遼抹筒棋褲唉朴咐孕誓喉妄拘鏈馳欄逝竊艷臭纖璣棵趁匠盈翁愁瞬嬰孝頸倘浙諒蔽暢贈妮莎尉凍跪闖葡後廚鴨顛遮誼圳吁侖辟瘤嫂陀框譚亨欽庸歉芝吼甫衫攤宴囑衷嬌陝矩浦訝聳裸碧摧薪淋恥膠屠鵝飢盼脖虹翠崩賬萍逢賺撐翔倡綿猴枯巫昭怔淵湊溪蠢禪闡旺寓藤匪傘碑挪瓊脂謊慨菩萄獅掘抄嶺暈逮砍掏狄晰罕挽脾舟痴蔡剪脊弓懶叉拐喃僚捐姊騷拓歪粘柄坑陌窄湘兆崖驕剎鞭芒筋聘鉤棍嚷腺弦焰耍俯厘愣廈懇饒釘寡憾摔疊惹喻譜愧煌徽溶墜煞巾濫洒堵瓷咒姨棒郡浴媚穌淮哎屁漆淫巢吩撰嘯滯玫碩釣蝶膝姚茂軀吏猿寨恕渠戚辰舶頒惶狐諷笨袍嘲啡潑銜倦涵雀旬僵撕肢壟夷逸茅僑輿窯涅蒲謙杭噢弊勛刮郊淒捧浸磚鼎籃蒸餅畝腎陡爪兔殷貞薦啞炭墳眨搏咳攏舅昧擅爽咖擱祿雌哨鞏絹螺裹昔軒謬諜龜媳姜瞎冤鴉蓬巷琳栽沾詐齋瞞彪厄咨紡罐桶壤糕頌膨諧壘咕隙辣綁寵嘿兌霉挫稽輻乞紗裙嘻哇繡杖塘衍軸攀膊譬斌祈踢肆坎轎棚泣屢躁邱凰溢椎砸趟帘帆棲竄丸斬堤塌販廂掀喀乖謎捏閻濱虜匙蘆蘋卸沼鑰株禱剖熙嘩劈怯棠胳樁瑰娛娶沫嗓蹲焚淘嫩'),
    (u'Set 3000', u'韻襯匈鈞豎峻豹撈菊鄙魄兜哄穎鎊屑蟻壺怡滲禿迦旱喲咸焉譴宛稻鑄鍛伽詹斃恍貶燭駭芯汁桓坊驢朽靖佣汝碌迄冀荊崔雁紳珊榜誦傍彥醇笛禽勿娟瞄幢寇睹賄踩霆嗚拱妃蔑諭縛詭篷淹腕煮倩卒勘馨逗甸賤炒燦敞蠟囚栗辜墊妒魁謠寞蜀甩涯枕丐泳奎泌逾叮黛燥擲藉樞憎鯨弘倚侮藩拂鶴蝕漿芙垃烤晒霜剿蘊圾綢嶼氫駝妝捆鉛逛淑榴丙痒鈔蹄犬躬晝藻蛛褐頰奠募耽蹈陋侶魅嵐侄虐墮陛瑩蔭狡閥絞膏垮莖緬喇絨攪凳梭丫姬詔鈕棺耿締懈嫉灶勻嗣鴿澡鑿緯沸疇刃遏爍嗅叭熬瞥骸奢拙棟毯桐砂莽瀉坪梳杉晤稚蔬蠅搗頃麼尷鏢詫尬硫嚼羨淪滬曠彬芽狸冥碳咧惕暑咯蘿洶腥窺俺潭崎麟撿拯厥澄萎哉渦滔暇溯鱗釀茵愕瞅暮衙誡斧兮煥棕佑嘶妓喧蓉刪櫻伺嗡娥梢壩蠶敷瀾杏綏冶庇撓摟倏聶婉噪稼鰭菱盞匿吱寢攬髓秉哺矢啪幟邵嗽挾缸揉膩馴纜晌癱貯覓朦僻隋蔓咋嵌虔畔瑣碟澀朧嘟蹦塚瀏裔襟叨訣旭蝦簿啤擒棗嘎苑牟嘔駱凸熄兀喔裳凹贖屯膛澆灼裘砰棘橡鹼聾姥瑜毋婭沮萌俏黯撇粟糞尹苟癲螞禹廖儉帖煎縷竇簇棱叩吶瑤墅鶯燙蛙歹伶蔥哮眩坤廓諱啼乍瓣矯跋枉梗廁琢譏釉窟斂軾廬胚呻綽扼懿炯竿慷虞錘栓槳蚊磅孽慚戳稟鄂饋垣濺咚鈣礁彰豁瞇磷雯墟迂瞻顱琉悼蝴揀渺眷憫汰懾嬸斐噓鑲炕宦趴繃窘襄珀囂拚酌濁毓撼嗜扛峭磕翹槽淌柵頹熏瑛頤忖'),
    (u'Set 3500', u'牡缀徊梨肪涕惫摹踱肘熔挚氯凛绎庶脯迭睦窍粥庵沧怠沁奕咙氨矗盔拇沛榻揣崭鞘鞠垦洽唾橱仕蜘痰袜峙柬蝉蟹谏鹃擎皓朕疤禺铲酶钝氓匣弧峨锥揪杠吭崛诬冉抒庚悍靡晦醋壕锯夭咦侈婢猾徘硝煽皂舵嗦狈靴捂疮郝苛秽茜搓芸酱赁檐饷蕉铀苔赦缎舷筷朔婪紊厮婿寥兢糙卦槐扒裴祀埔絮芭屉痪霄绽宵邑霖岔饵茄韧琪邹瑚憋殆噜忒忿衅淳悖髦孜粤隘濒铮畸剔坞篱淀蓦唬锣汀趾缉嫦斟鞍扳拴诅谟呃懦逞犁忏拧亥佟叱舜绊龚腮邸椒蔚湛狩眶栈薇肮瀑渣褂叽臀妞巍唔疚鲤戎肇笃辙娴阮札懊焘恤疹潇铝涤恃喽砌遁楞阱咎洼炳噬枫拷哆矶苇翩窒侬靶胰芜辫嚎妾幌踉佃葫皖拽滤睬俞匕谤嗤捍孵倪瘾敝匡磋绫淆尧蕊烘璋亢轧赂蝗榆骏诛勺梵炽笠颌闸狒樊镕垢瘟缪菇琦剃迸溺炫惚嗨陨赃羁臻嘀膳赣踌殉桔瞿闽豚掺沌惰喳椭咪霎侃猝窖戮祠瞩菁躇佬肋咄忡雍忱蕾跄硅伎炊钊蝠屎拭谛褪丞卉隧茸钳啃伢闺舔蹬挛眺袱陇殴柿梧惺弛侥琛捅酝薯曳澈锈稠眸咆簧鸥疡渎汲嬉脓骡穗槛拎巳邢廿搀曙樵隅筛谒倭痹猖佯肛奚甭抨蛾唠荧嵩漱酋攘诘篡睿噩怅盎徙鞅漓祟睫攸翎呛筐堑檀寅磊驭惘吠驮瑙炬痉曝恺胺萤敕筝幡霹竺烙毗鸠埠蒜阜嘈乒帷啄鳌毡阙褥搔笋冕狞韶骼蔼烹奄嫖沐噗岑蛟掳咏弩捻圃孚悴诣呱祁捶钠袄澎氮恪雏撮堰彷鹦晖犀腑沽橄掐亵龋嗒咀祺锚')
  ]


hanziGrades = [grade for grade, _ in hanziByGrades]

# Blatantly duplicated from anki.stats.isKanji because I don't want this module
# to depend on Anki stuff, and it's a tiny bit of code.
def isHanzi(unichar):
    import unicodedata
    
    try:
        return unicodedata.name(unichar).find('CJK UNIFIED IDEOGRAPH') >= 0
    except ValueError:
        # A control character
        return False

def hanziGrade(hanzi):
    if not isHanzi(hanzi):
        return None
    
    for grade, hanzis in hanziByGrades:
        if hanzi in hanzis:
            return grade
    
    # Default to Non-HSK
    return hanziByGrades[-1][0]

# This function takes three arguments (firstAnsweredValues, daysInRange) where:
#  * 'firstAnsweredValues' is a list of (string, date, date) tuples where each string
#    value that has been answered occurs exactly once, and is paired with the date
#    at which it was first answered by the user and the date at which the card was created.
#  * 'daysInRange' is an integer expressing how many days of data should be returned.
#
# This function returns a tuple (days, cumulativeTotal, cumulativesByGrade) where:
#  * 'days' is a list of (negative) day indexes, with 0 representing today
#  * 'cumulativeTotal' is a list containing, for the corresponding day, the number
#    of hanzi that the user has "learned" up until the day
#  * 'cumulativesByGrade' is a dictionary of lists containing the same information, but
#    broken down by grade
def hanziDailyStats(firstAnsweredValues, daysInRange):
    # Holds, for each day, the set constructued by appending values of all fields
    # for the cards that were first answered on the given day and removing duplicates
    firstLearnedByDay = {}
    firstDay = 0
    endOfDay = time.time()
    for (value, firstAnswered, createdTime) in firstAnsweredValues:
        # To work around a former bug in Anki, if the answered date was 0 then use the card creation
        # date instead: <http://github.com/batterseapower/pinyin-toolkit/issues/closed/#issue/48>
        if firstAnswered == 0:
            firstAnswered = createdTime
        
        # FIXME: this doesn't account for midnightOffset
        day = int((firstAnswered - endOfDay) / 86400.0)
        firstLearnedByDay[day] = utils.updated(firstLearnedByDay.get(day, set()), set(value))
        
        # Record the earliest moment at which we answered any question
        if day < firstDay:
            firstDay = day

    # Internal state while we run time forward
    alreadyLearnt = set()
    cumulativeTotal = 0
    cumulativeByGrades = {}
    
    # Totals for output accumulated while running time forward
    days, cumulativeTotals, cumulativesByGrades = [], [], {}
    
    # The core of the algorithm. Run time forward:
    # NB: be careful to start at -daysInRange if we don't have data for
    # later times. This is to ensure we get an initial 0 when working out
    # what the graph x range should be later on, which is important to ensure
    # all the graph gets displayed on e.g. decks with large initial imports.
    # See <http://github.com/batterseapower/pinyin-toolkit/issues/#issue/69>
    for day in xrange(min(firstDay, -daysInRange), 1):
        for hanzi in firstLearnedByDay.get(day, set()):
            # First check: if we have already learnt this thing, we don't care
            if hanzi in alreadyLearnt:
                continue
            
            # Second check: if this thing is not actually a hanzi, we don't care
            grade = hanziGrade(hanzi)
            if grade is None:
                continue
            
            # It's new and it's a hanzi: remember we learnt it
            alreadyLearnt.add(hanzi)
            
            # Update running totals
            cumulativeTotal += 1
            cumulativeByGrades[grade] = cumulativeByGrades.get(grade, 0) + 1
        
        # We're done with the day. Add output to the graph if we are interested
        if day > -daysInRange:
            # X axis
            days.append(day)
            
            # "Total" Y axis
            cumulativeTotals.append(cumulativeTotal)
            
            # Other Y axes (one per grade)
            for grade in hanziGrades:
                cumulativesByGrades[grade] = cumulativeByGrade = cumulativesByGrades.get(grade, [])
                cumulativeByGrade.append(cumulativeByGrades.get(grade, 0))
    
    return days, cumulativeTotals, cumulativesByGrades

if __name__ == "__main__":
    import unittest
    
    class HanziDailyStatsTest(unittest.TestCase):
        def testNoDays(self):
            self.assertEquals(self.statsByDay([], 0), [])
        
        def testSingleDay(self):
            self.assertEquals(self.statsByDay([(u"的", 0)], 1), [
                (0, [1, 1, 0, 0, 0, 0])
              ])
        
        def testComplex(self):
            self.assertEquals(self.statsByDay([
                (u"的是斯", -1),
                (u"轴", 0),
                (u'暇TSHIRT', -3),
                (u'失斯', -1),
                (u'格捂Western Characters', -5),
                (u'', -3),
                (u'撞冒', -6),
                (u'迅迅迅迅迅', -10),
                (u'扛', -2)
              ], 5), [
                (-4, [5, 1, 3, 0, 0, 1]),
                (-3, [6, 1, 3, 0, 0, 2]),
                (-2, [7, 1, 4, 0, 0, 2]),
                (-1, [11, 3, 5, 1, 0, 2]),
                (0, [12, 3, 5, 1, 0, 3])
              ])
        
        def testZeroFirstAnsweredTreatedAsCreatedDate(self):
            self.assertEquals(self.stats([
                (u"的是斯", 0, self.nDaysAgo(-0)),
                (u"轴", self.nDaysAgo(0), self.nDaysAgo(30)),
                (u'暇', 0, self.nDaysAgo(-3))
              ], 2), [
                (-1, [1, 0, 0, 0, 0, 1]),
                (0, [5, 2, 0, 1, 0, 2])
              ])
        
        def testGetZeroesForDaysWithNoData(self):
            self.assertEquals(self.statsByDay([
                (u"的", -1),
              ], 3), [
                (-2, [0, 0, 0, 0, 0, 0]),
                (-1, [1, 1, 0, 0, 0, 0]),
                (0, [1, 1, 0, 0, 0, 0])
              ])
        
        def statsByDay(self, firstAnsweredValuesByDay, daysInRange):
            # Turn the day based time in the test into a seconds based one relative to the present
            # Zero out the created date because we will never need it
            firstAnsweredValues = [(value, self.nDaysAgo(firstAnsweredDay), 0) for value, firstAnsweredDay in firstAnsweredValuesByDay]
            return self.stats(firstAnsweredValues, daysInRange)
            
        def stats(self, firstAnsweredValues, daysInRange):
            # Actually do the test
            days, cumulativeTotals, cumulativesByGrades = hanziDailyStats(firstAnsweredValues, daysInRange)
            
            # Munge the result into a format more amenable to assertion: a list of (day, grade) pairs, where the grades
            # are presented in a list: total first, then by grade.
            return [(day, [cumulativeTotals[n]] + [cumulativesByGrades[grade][n] for grade in hanziGrades]) for n, day in enumerate(days)]
        
        def nDaysAgo(self, n):
            return (time.time() - 100) + (n * 86400.0)
    
    unittest.main()